[
    {
        "id": 10021,
        "name": "",
        "username": "tango",
        "avatar_template": "/letter_avatar_proxy/v4/letter/t/e36b37/{size}.png",
        "created_at": "2022-08-28T15:01:51.140Z",
        "cooked": "<p>Censored: Distraction and Diversion Inside China’s Great Firewall<br>\nMargaret E. Roberts</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://press.princeton.edu/books/hardcover/9780691178868/censored\">\n  <header class=\"source\">\n      <img src=\"book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/e67d438ad90a70583a250ccf0fa6e322650b2630.png\" class=\"site-icon\" data-dominant-color=\"F28E28\" width=\"16\" height=\"16\">\n\n      <a href=\"https://press.princeton.edu/books/hardcover/9780691178868/censored\" target=\"_blank\" rel=\"noopener\">press.princeton.edu</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/361;\"><img src=\"book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/491180910a8c3e64fce6d5a9d4b7f4ea02145cbe_2_690x362.jpeg\" class=\"thumbnail\" data-dominant-color=\"C8B1AE\" width=\"690\" height=\"362\"></div>\n\n<h3><a href=\"https://press.princeton.edu/books/hardcover/9780691178868/censored\" target=\"_blank\" rel=\"noopener\">Censored</a></h3>\n\n  <p>A groundbreaking and surprising look at contemporary censorship in China</p>\n\n  <p>\n    <span class=\"label1\">Price: GBP 30.000000</span>\n  </p>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>This book examines Internet censorship in China using research and case studies. The central question addressed by the book is this: why do governments censor, when censorship is technically possible to circumvent? Roberts’s position is that, in China and elsewhere, the fact that censorship impedes access to information, but does not block it completely, is not a flaw but a feature. This “porous” censorship, in fact, serves the government’s policy goals better than would a firewall that was 100% effective at blocking. Censorship is best understood not as a ban, but as a <em>tax</em> on information that makes some things relatively more expensive to access—in terms of time, money, and inconvenience. The economic metaphors of cost and competition reoccur frequently, and help to explain some observed behaviors of censors that, at first, appear irrational.</p>\n<p>Roberts identifies three modes of censorship: <em>fear</em>, <em>friction</em>, and <em>flooding</em>, devoting a chapter to each. Fear is what many people think of when they think of censorship: overt rules about what is permissible to access, and penalties for violations. (A primary contribution of the book is that fear, as a mechanism of censorship, has non-obvious disadvantages for the censor that may cause it to prefer the alternatives of friction and flooding.) Friction is putting up barriers that make information more difficult to access—even if it is technically possible to evade those barriers and there is no penalty for doing so. Flooding is when the censor tries to overwhelm online discussion by posting irrelevant and distracting information, creating competing alternatives to what it wants to obscure. These three modes are investigated through experiments on the Chinese Internet and Internet users in China.</p>\n<p>A conventional understanding of censorship is that it is a question of deterrence: if the government catches you accessing something you’re not supposed to, you are thrown in jail or otherwise punished; fear of punishment is what keeps people from breaking the rules. Fear-based censorship, however, turns out to have unexpected costs for a censor, and, in China, is comparatively little used. Among the disadvantages of fear-based censorship is that it must be visible: the censor must state what the rules are, and people must know when they have broken them. This can perversely create <em>more</em> interest in the prohibited information, meanwhile making the government an obvious agent of repression. Roberts describes experiments that show people reacting more in anger or curiosity than in fear when they find they have been the victim of overt censorship. One experiment found matched pairs of social media posts (sourced from <a href=\"https://jmsc.hku.hk/2016/03/weiboscope/\">Weiboscope</a>) from similar users with similar contents, where one user’s post was removed and the other’s was not. The authors of removed posts, instead of being discouraged by the removal, were more likely to continue posting on the same topic, and more likely to complain about censorship. Another experiment simulated the experience of reaching a block page when trying to read an online article. People who saw a block page were more likely to persist in trying to read about the article’s topic, and afterward were less likely to express support for Internet regulation. Despite its drawbacks, the Chinese government <em>does</em> employ fear-based censorship, but in a targeted way. High-profile people who have a wide reach—journalists, activists, entertainers—are more likely to be the target of intimidation and punishment. Ordinary people are, in comparison, at little risk of reprisal for creating or accessing restricted information—but the friction imposed by the Great Firewall means most of them rarely do so.</p>\n<p>The book models Internet users as “rationally ignorant” consumers of information. There is simply too much information out there to consume it all; therefore people are selective about what they consume, and only spend time in accessing what they think will be worth the trouble. When the Great Firewall blocks a site, it increases the effective “cost” of accessing that site, cost being measured in all the annoyances that come with circumvention: acquiring a VPN, paying for it, reading documentation in a foreign language, etc. If the cost of access is sufficiently high, people will find something else to do with their time. Roberts frames the phenomenon in terms of “elasticity of demand” for information, in another economic analogy. If a blocked site is to be accessed, either the cost to access it must be low, or the demand to access it must be high; either circumvention is easy to use, or the information is so important it is worth the pain of using circumvention. The high general availability of information on the Internet creates an environment of elastic demand: even mild inconveniences become major obstacles when information is cheap and plentiful. But there are times—during sudden crises, for example—when demand becomes inelastic: the need for news overrides the friction of accessing it.</p>\n<p>Roberts shares an experiment that shows how deletion of social media posts imposes friction on online discussion. Because fewer moderators work on weekends, posts made on Friday tend to persist longer before being deleted than posts made on other days—and discussion of sensitive events that occur on weekends is correspondingly more prolonged than those that occur on weekdays. Another experiment compares Twitter posts that are geo-tagged as being from China, where Twitter is blocked, and from Hong Kong, where Twitter was not blocked at the time of the experiment, in 2014. About 1.7% of Internet users in Hong Kong posted on Twitter each day, while only 0.2% of Internet users in China did so. The fact that there <em>are</em> posts from China shows that some people do use circumvention—but the far lower proportion of users in China, compared to Hong Kong, is attributable, at least in part, to the increased friction of accessing Twitter from China. In comparison with Sina Weibo, a Chinese service similar to Twitter, Chinese Twitter users were more likely to post about politics, and more likely to use English words. Case studies of blocked web sites (<a href=\"https://www.nytimes.com/2014/06/03/business/chinas-battle-against-google-heats-up.html\">Google in June 2014</a>, <a href=\"https://www.forbes.com/sites/thomasbrewster/2015/05/22/wikipedia-disturbed-over-fresh-china-censorship/\">Wikipedia in May 2015</a>, <a href=\"https://www.bbc.com/news/technology-29409533\">Instagram in September 2014</a>) show that the blocks, even if circumventable in theory, were effective in decreasing access.</p>\n<p>To me, the most striking part of the chapter on friction is the analysis of a <a href=\"https://www.jrcef.cn/data/\">survey of urban residents in China done in 2015</a>. The main conclusion of the analysis is that not many people jump the wall, despite the low cost of doing so. The chart below, Figure 5.3 from the book, is sobering. Only 60% of urban respondents had ever used the Internet; of these, only 52% knew there is something called the Great Firewall and that there are ways to circumvent it. Only 5% of those surveyed had jumped the wall, ever. When those who had not were asked why not, their responses indicated they were negatively motivated not by fear, but rather by inconvenience, from not knowing how, or not having a reason to circumvent. Circumvention was correlated with age and education: those that had jumped the wall were more likely to be young, politically aware, and understand English.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/9585f8809f2f1051c0c9d02c5f73a9835fd17df5.png\" data-download-href=\"https://ntc.party/uploads/default/9585f8809f2f1051c0c9d02c5f73a9835fd17df5\" title=\"Bar chart showing the proportion of users who know about and jump the GFW, by age\"><img src=\"book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/9585f8809f2f1051c0c9d02c5f73a9835fd17df5_2_690x413.png\" alt=\"Bar chart showing the proportion of users who know about and jump the GFW, by age\" data-base62-sha1=\"lkKaMX0xDzWqgkJBDAVO1cRL8hv\" width=\"690\" height=\"413\" srcset=\"book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/9585f8809f2f1051c0c9d02c5f73a9835fd17df5_2_690x413.png, book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/9585f8809f2f1051c0c9d02c5f73a9835fd17df5_2_1035x619.png 1.5x, book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/9585f8809f2f1051c0c9d02c5f73a9835fd17df5_2_1380x826.png 2x\" data-dominant-color=\"575757\"><div class=\"meta\"><svg class=\"fa d-icon d-icon-far-image svg-icon\" aria-hidden=\"true\"><use href=\"#far-image\"></use></svg><span class=\"filename\">Bar chart showing the proportion of users who know about and jump the GFW, by age</span><span class=\"informations\">2000×1200 43.5 KB</span><svg class=\"fa d-icon d-icon-discourse-expand svg-icon\" aria-hidden=\"true\"><use href=\"#discourse-expand\"></use></svg></div></a></div><br>\n<em>Figure 5.3: Internet use, knowledge of the Great Firewall, and evasion of censorship by age.</em></p>\n<p>The third mode of censorship discussed in the book is flooding, where governments coordinate efforts to derail discussion and distract people from unwanted topics. If friction diminishes access by increasing the cost of certain information, flooding accomplishes the same goal by <em>decreasing</em> the cost of alternatives. Flooding, as a mechanism of censorship, has the advantage that it does not bring attention to what the government wants to hide. It can be useful in a crisis situation, when elasticity of demand for information is low and friction alone is insufficient. The flooding apparatus in China is well developed, with news outlets receiving instructions from the Party on what stories to cover and how, and <a href=\"https://en.wikipedia.org/wiki/50_Cent_Party\">paid online commenters</a> who make millions of posts per year in an effort to control and contain discussion. Roberts describes an experiment to uncover centrally coordinated news stories, by scraping the online edition of newspapers, measuring the textual similarity of stories, and correlating near matches with <a href=\"https://chinadigitaltimes.net/china/directives-from-the-ministry-of-truth/\">leaked propaganda directives</a>. Coordinated news coverage happens particularly during sensitive times and on sensitive issues. A separate investigation into <a href=\"https://web.archive.org/web/20160331215004/https://xiaolan.me/50-cent-party-jxgzzg.html\">leaked email archives</a> of a local propaganda department reveals some of the rationale and technique behind flooding. The goal is not to win debates, but rather to prevent debates from occurring. Flooding posts are not even always pro-government messages; they may be simply irrelevancies that  do no more than drown out other voices.</p>\n<p>A point made repeatedly is that the Great Firewall’s porous censorship has the effect of segmenting the population into groups and preventing them from working cooperatively. The most privileged segment of society, those who have the time, inclination, and knowledge to circumvent, may do so; everyone else lives with censorship, willingly or unwillingly. As Section 5.2.2 says, “the Firewall succeeds in creating a porous but effective barrier between a skeptical class and the public they would have to connect with to have a bigger political impact.” The fact that only relatively few people are capable of circumvention has the additional advantage, for the censor, of making that group easier to keep an eye on, and more susceptible to fear-based controls, like threats and harassment.</p>\n<p>Thanks to Margaret Roberts for reviewing a draft of this summary, and for providing a copy of Figure 5.3.</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2022-08-28T15:01:51.140Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 190,
        "reads": 35,
        "readers_count": 34,
        "score": 957.0,
        "yours": false,
        "topic_id": 3148,
        "topic_slug": "book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://press.princeton.edu/books/hardcover/9780691178868/censored",
                "internal": false,
                "reflection": false,
                "title": "Censored | Princeton University Press",
                "clicks": 19
            },
            {
                "url": "https://www.jrcef.cn/data/",
                "internal": false,
                "reflection": false,
                "title": "Data - JRCEF",
                "clicks": 2
            },
            {
                "url": "https://jmsc.hku.hk/2016/03/weiboscope/",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://en.wikipedia.org/wiki/50_Cent_Party",
                "internal": false,
                "reflection": false,
                "title": "50 Cent Party - Wikipedia",
                "clicks": 0
            },
            {
                "url": "https://chinadigitaltimes.net/china/directives-from-the-ministry-of-truth/",
                "internal": false,
                "reflection": false,
                "title": "Directives from the Ministry of Truth Archives - China Digital Times (CDT)",
                "clicks": 0
            },
            {
                "url": "https://www.nytimes.com/2014/06/03/business/chinas-battle-against-google-heats-up.html",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://www.forbes.com/sites/thomasbrewster/2015/05/22/wikipedia-disturbed-over-fresh-china-censorship/",
                "internal": false,
                "reflection": false,
                "title": "Wikipedia Disturbed Over Fresh China Censorship",
                "clicks": 0
            },
            {
                "url": "https://web.archive.org/web/20160331215004/https://xiaolan.me/50-cent-party-jxgzzg.html",
                "internal": false,
                "reflection": false,
                "title": "[你懂的]某地区网宣部邮箱打包下载——见证五毛党的工作(第二波更新) – Xiaolan's Blog",
                "clicks": 0
            },
            {
                "url": "https://www.bbc.com/news/technology-29409533",
                "internal": false,
                "reflection": false,
                "title": "Instagram appears blocked in China - BBC News",
                "clicks": 0
            },
            {
                "url": "https://ntc.party/t/%D1%81%D0%B5%D0%B2%D0%B5%D1%80%D0%BD%D0%B0%D1%8F-%D0%BA%D0%BE%D1%80%D0%B5%D1%8F-%D0%B8-%D0%BA%D0%B8%D1%82%D0%B0%D0%B9-%D0%B2-%D0%B4%D0%B5%D0%B9%D1%81%D1%82%D0%B2%D0%B8%D0%B8-%D0%B2-%D1%80%D1%84/5515/11",
                "internal": true,
                "reflection": true,
                "title": "Северная Корея и Китай в действии, в РФ",
                "clicks": 3
            },
            {
                "url": "https://ntc.party/t/%C2%AB%D1%86%D0%B5%D0%BD%D0%B7%D1%83%D1%80%D0%B0-%D0%B7%D0%B0-%D0%B2%D0%B5%D0%BB%D0%B8%D0%BA%D0%BE%D0%B9-%D1%81%D1%82%D0%B5%D0%BD%D0%BE%D0%B9-%D1%81%D0%BB%D0%BE%D0%B6%D0%BD%D0%B5%D0%B5-%D1%80%D0%BE%D1%81%D1%81%D0%B8%D0%B9%D1%81%D0%BA%D0%BE%D0%B9-%E2%80%94-%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE-%D0%BF%D0%BE%D0%BB%D0%B0%D0%B3%D0%B0%D1%82%D1%8C%D1%81%D1%8F-%D0%BD%D0%B0-%D0%BA%D0%B8%D1%82%D0%B0%D0%B9%D1%81%D0%BA%D0%B8%D0%B5-%D0%B8%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%BF%D0%BE-%D0%B5%D1%91-%D0%BE%D0%B1%D1%85%D0%BE%D0%B4%D1%83%C2%BB/5580",
                "internal": true,
                "reflection": true,
                "title": "«Цензура за Великой стеной сложнее российской — можно полагаться на китайские инструменты по её обходу»",
                "clicks": 0
            }
        ],
        "read": true,
        "user_title": "dnstt developer",
        "title_is_group": false,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 26,
        "hidden": false,
        "trust_level": 3,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/book-summary-censored-distraction-and-diversion-inside-chinas-great-firewall/3148/1",
        "can_translate": false
    }
]