[
    {
        "id": 1258,
        "name": "",
        "username": "tango",
        "avatar_template": "/letter_avatar_proxy/v4/letter/t/e36b37/{size}.png",
        "created_at": "2020-04-27T23:02:28.763Z",
        "cooked": "<p>SymTCP: Eluding Stateful Deep Packet Inspection with Automated Discrepancy Discovery<br>\nZhongjie Wang, Shitong Zhu, Yue Cao, Zhiyun Qian, Chengyu Song, Srikanth V. Krishnamurthy, Kevin S. Chan, Tracy D. Braun<br>\n<a href=\"https://censorbib.nymity.ch/#Wang2020a\" class=\"onebox\" target=\"_blank\" rel=\"nofollow noopener\">https://censorbib.nymity.ch/#Wang2020a</a><br>\n<a href=\"https://github.com/seclab-ucr/SymTCP\" rel=\"nofollow noopener\">https://github.com/seclab-ucr/SymTCP</a></p>\n<p>This paper presents SymTCP, a system to automatically discovering packet sequences that desynchronize DPI middleboxes. A middlebox is desynchronized when its notion of the state of a TCP connection differs from that of the client and server. The core idea is to use <a href=\"https://en.wikipedia.org/wiki/Symbolic_execution\" rel=\"nofollow noopener\">symbolic execution</a> to explore code paths that leads to state changes in an actual implementation of TCP. Implementations of TCP are complicated, and middlebox simulations of endpoint TCP state tend to be simplified approximations. Even though a middlebox may not be directly inspectable, a diverse set of packets that exercise most of an endpoint’s code paths are also likely to exercise most of a middlebox’s code paths, and some of those code paths will lead the endpoint and middlebox to different internal states. The output of SymTCP is a set of packet sequences that terminate in an <em>evasion packet</em>—a packet that is ignored by the middlebox but interpreted by the server—or an <em>insertion packet</em>—a packet that is interpreted by the server but ignored by the middlebox. Either of these cases (made formal in Section III) is good for desynchronizing the middlebox.</p>\n<p>The process begins by manually annotating <em>accept points</em> and <em>drop points</em> in a TCP implementation—places in the code where a packet either modifies the state of a connection, or is removed from consideration. The authors label 6 accept points and 38 drop points in the Linux 5.4.5 TCP server implementation. The next step is the “offline” phase: symbolic execution to find constraints on packets that lead to known accept and drop points. Section V discusses the challenges involved in symbolically executing a complicated piece of code like the Linux kernel TCP implementation. After that comes the “online” phase: solving the constraints to generate packet sequences, and sending them through the middlebox. In the authors’ experience, there were too many packet sequences to test effectively, so they sub-sampled the list, while retaining all the distinct accept and drop points. The middlebox is presumed to be a black box whose state is not directly knowable, so there is a final probe step that sends packets containing a keyword designed to provoke a reaction (e.g. blocking) by the middlebox. The output of executing this process for many sets of constraints is a set of packet sequences, each of which terminates in an evasion packet or an insertion packet. These sequences can then be manually examined to understand how they work.</p>\n<p>They tested using the Linux TCP server implementation and three middleboxes: <a href=\"https://zeek.org/\" rel=\"nofollow noopener\">Zeek</a>, <a href=\"https://www.snort.org/\" rel=\"nofollow noopener\">Snort</a>, and the Great Firewall of China. SymTCP found evasion and insertion strategies against all, some new and some previously known (Tables IV, V, and VI).</p>\n<p>Thanks to Zhongjie Wang for commenting on a draft of this post.</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2020-04-27T23:02:28.763Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 24,
        "reads": 7,
        "readers_count": 6,
        "score": 121.4,
        "yours": false,
        "topic_id": 470,
        "topic_slug": "paper-summary-symtcp-eluding-stateful-deep-packet-inspection-with-automated-discrepancy-discovery-ndss-20",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://github.com/seclab-ucr/SymTCP",
                "internal": false,
                "reflection": false,
                "title": "GitHub - seclab-ucr/SymTCP: Automatic Discrepancy Discovery for DPI Elusion",
                "clicks": 4
            },
            {
                "url": "https://censorbib.nymity.ch/#Wang2020a",
                "internal": false,
                "reflection": false,
                "title": "The Internet censorship bibliography",
                "clicks": 4
            },
            {
                "url": "https://en.wikipedia.org/wiki/Symbolic_execution",
                "internal": false,
                "reflection": false,
                "title": "Symbolic execution - Wikipedia",
                "clicks": 0
            },
            {
                "url": "https://www.snort.org/",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://zeek.org/",
                "internal": false,
                "reflection": false,
                "title": "The Zeek Network Security Monitor",
                "clicks": 0
            }
        ],
        "read": true,
        "user_title": "dnstt developer",
        "title_is_group": false,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 26,
        "hidden": false,
        "trust_level": 3,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/paper-summary-symtcp-eluding-stateful-deep-packet-inspection-with-automated-discrepancy-discovery-ndss-20/470/1",
        "can_translate": false
    }
]