[
    {
        "id": 14261,
        "name": "",
        "username": "tango",
        "avatar_template": "/letter_avatar_proxy/v4/letter/t/e36b37/{size}.png",
        "created_at": "2023-06-11T04:23:34.122Z",
        "cooked": "<p>Towards a Scalable Censorship-Resistant Overlay Network based on WebRTC Covert Channels<br>\nDiogo Barradas, Nuno Santos<br>\n<a href=\"https://censorbib.nymity.ch/#Barradas2020b\">https://censorbib.nymity.ch/#Barradas2020b</a></p>\n<p><a href=\"https://censorbib.nymity.ch/#Barradas2020a\">Protozoa</a> showed a way of making peer-to-peer covert channels using WebRTC, but left open the questions of how peers were to discover each other and establish trust, and what to do if you don’t directly know anyone with access to the free Internet. This paper sketches a design for a censorship-resistant overlay network (CRON) built on top of point-to-point Protozoa links. The overlay network could support censorship circumvention, as well as other applications such as a CDN, file system, or key–value database.</p>\n<p>CRON takes advantage of an existing graph of social relationships. If Alice and Bob know each other, they can start a Protozoa chatroom and exchange information with each other directly. If Alice and Bob know each other, and Bob and Carol know each other, but Alice and Carol do not know each other, then Bob can facilitate a connection between Alice and Carol in one of two ways. As a <em>rendezvous</em>, Bob can create a chatroom and invite both Alice and Carol to it, and then Alice and Carol can correspond. Or, as a <em>relay</em>, Bob makes a chatroom with Alice and a separate chatroom with Carol, then copies information from one to the other. If the goal is censorship circumvention, many of these segments can be chained together in order to reach a user who is in a position to proxy to the outside network. If all the chatrooms are online at the same time, CRON supports real-time proxying; otherwise it can operate according to a delay-tolerant, store-and-forward model.</p>\n<p><a href=\"https://www.dpss.inesc-id.pt/~nsantos/papers/barradas_dicg20.pdf#page=4\">Section 4</a> considers countermeasures to various attacks. A censor might be suspicious of unusual WebRTC connection patterns, such as a user apparently being on two video calls at the same time, or unusual call durations. For this the authors suggest putting constraints on peer-to-peer communication, in either a passive mode, where communication only happens opportunistically during naturally occurring chatrooms, or an active mode, in which the software creates new chatrooms on demand, but tries to keep traffic features within expected parameters. A censor that is able to subvert the WebRTC signaling mechanism could inspect the decrypted purported media content and easily identify that Protozoa is in use (because Protozoa replaces encoded media with its own unrelated ciphertext). For this, the authors propose replacing Protozoa with keyed video steganography (which would eventually be realized as <a href=\"https://ntc.party/t/paper-summary-stegozoa-enhancing-webrtc-covert-channels-with-video-steganography-for-internet-censorship-circumvention-asiaccs-2022/4670\">Stegozoa</a>). To protect against infiltration of the social graph by a censor, the authors consider configurable trust settings for a user’s direct contacts.</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2023-06-11T04:26:10.089Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 3,
        "reads": 16,
        "readers_count": 15,
        "score": 18.2,
        "yours": false,
        "topic_id": 4669,
        "topic_slug": "paper-summary-towards-a-scalable-censorship-resistant-overlay-network-based-on-webrtc-covert-channels-dicg-2020",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://censorbib.nymity.ch/#Barradas2020b",
                "internal": false,
                "reflection": false,
                "title": "The Internet censorship bibliography",
                "clicks": 1
            },
            {
                "url": "https://censorbib.nymity.ch/#Barradas2020a",
                "internal": false,
                "reflection": false,
                "title": "The Internet censorship bibliography",
                "clicks": 1
            },
            {
                "url": "https://www.dpss.inesc-id.pt/~nsantos/papers/barradas_dicg20.pdf#page=4",
                "internal": false,
                "reflection": false,
                "clicks": 1
            },
            {
                "url": "https://ntc.party/t/paper-summary-stegozoa-enhancing-webrtc-covert-channels-with-video-steganography-for-internet-censorship-circumvention-asiaccs-2022/4670",
                "internal": true,
                "reflection": true,
                "title": "Paper summary: Stegozoa: Enhancing WebRTC Covert Channels with Video Steganography for Internet Censorship Circumvention (AsiaCCS 2022)",
                "clicks": 1
            }
        ],
        "read": true,
        "user_title": "dnstt developer",
        "title_is_group": false,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 26,
        "hidden": false,
        "trust_level": 3,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/paper-summary-towards-a-scalable-censorship-resistant-overlay-network-based-on-webrtc-covert-channels-dicg-2020/4669/1",
        "can_translate": false
    }
]