[
    {
        "id": 4329,
        "name": "",
        "username": "tango",
        "avatar_template": "/letter_avatar_proxy/v4/letter/t/e36b37/{size}.png",
        "created_at": "2021-10-21T15:25:35.242Z",
        "cooked": "<p>Too Close for Comfort: Morasses of (Anti-) Censorship in the Era of CDNs<br>\nDevashish Gosain, Mayank Mohindra, Sambuddho Chakravarty<br>\n<a href=\"https://petsymposium.org/2021/files/papers/issue2/popets-2021-0023.pdf\">https://petsymposium.org/2021/files/papers/issue2/popets-2021-0023.pdf</a></p>\n<p>This paper is about geolocating popular web sites (from the perspective of measurement points actually located in a selected country) and the implications for anti-censorship systems that depend on covert proxies being located outside a censor’s zone of control. In the current age of CDNs, web sites may be multiply homed. Their effective location is not an origin web server, but a CDN front-end server—and which front-end server you get depends on where you ask from. Given a country and a web site, this paper provides a method for determining whether the web site is hosted within that country’s borders, as seen by users in that country. Case studies in five countries show that the majority of country-specific top sites are effectively hosted within those respective countries.</p>\n<p>The core measurement technique is something the authors call Region Specific Constraint Based Geolocation (R-CBG). The speed at which packets travel in a network is limited, which means you can estimate distance by round-trip time (RTT). The speed of packets is limited physically by the speed of light, but in practice effects like queuing delays mean that packets move more slowly than that. To deal with these other sources of delay, <a href=\"https://www.cs.bu.edu/fac/crovella/paper-archive/imc04-geolocation-full.pdf\">Constraint Based Geolocation</a> involves a preliminary calibration phase, in which measurement nodes ping each other to establish empirical bounds on the relation between distance and RTT, in the context of that set of measurement nodes. After calibration, geolocate a target IP address by measuring its RTT from each of the measurement nodes. Each measurement node’s RTT translates to a distance, which is the radius of a circle on the surface of the earth, centered on that measurement node. The intersection of all such circles is the predicted geolocation area of the target.</p>\n<p>The difference with <em>Region Specific</em> Constraint Based Geolocation is that it uses only measurement nodes that are located <em>in or near</em> the country under investigation. The authors found this heuristic necessary to get high accuracy in ground-truth evaluations. For the purposes of this research, the desired output of geolocation is not necessarily a latitude and longitude, but a determination of whether the target IP address is likely located <em>inside</em> or <em>outside</em> the country. After finding the area of intersection of the restricted set of measurement nodes, the inside/outside prediction is made as follows: if the centroid of the intersection is within the country’s borders, and the intersection is not so large that it encompasses the entire country, the target is inside; otherwise it is outside. Some additional care is needed to deal with <a href=\"https://en.wikipedia.org/wiki/Anycast\">anycast</a> addresses, which may be different places in the network, depending on the source. The authors applied R-CBG in five countries (Brazil, India, Iran, Saudi Arabia, United States) over five months and found that between 60% and 90% of the Alexa top 1000 sites specific to each country are effectively hosted within that country. Their measurement nodes were <a href=\"https://atlas.ripe.net/\">RIPE Atlas</a> probes, at least 15 per country.</p>\n<p>The implications of this research for anti-censorship is that ostensibly “foreign” network destinations may actually be hosted within the country—and therefore within the censor’s sphere of influence—which may have network detection or legal consequences. For example, <a href=\"https://refraction.network/\">decoy routing</a> systems commonly require passing specially tagged traffic through a relay station to an overt site; this is not possible if the path to the overt site is short-circuited by an in-country CDN front-end server. Servers used for <a href=\"https://www.bamsoftware.com/papers/fronting/\">domain fronting</a> or audiovisual tunneling in the style of <a href=\"https://censorbib.nymity.ch/#McPherson2016a\">CovertCast</a>, even if their traffic is not directly visible to a censor, are possibly at greater risk of coercion if they are located within the censor’s legal jurisdiction. The <a href=\"https://censorbib.nymity.ch/#Holowczak2015a\">CacheBrowser research</a> (Section 3.2.1) showed that CDN front-end servers themselves may apply different censorship rules inside and outside a country; but some CDN architectures (particularly anycast-based ones) may make it hard to actually get packets routed to an external front-end server. The observation that many popular destinations are located close to the user also challenges the assumption that a few powerful ASes have visibility over a large fraction of Internet traffic.</p>\n<p>Thanks to the authors for reviewing a draft of this summary.</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2021-10-21T15:25:35.242Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 6,
        "reads": 9,
        "readers_count": 8,
        "score": 31.8,
        "yours": false,
        "topic_id": 1410,
        "topic_slug": "paper-summary-too-close-for-comfort-morasses-of-anti-censorship-in-the-era-of-cdns-pets-2021",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://petsymposium.org/2021/files/papers/issue2/popets-2021-0023.pdf",
                "internal": false,
                "reflection": false,
                "clicks": 3
            },
            {
                "url": "https://atlas.ripe.net/",
                "internal": false,
                "reflection": false,
                "title": "Atlas Console",
                "clicks": 0
            },
            {
                "url": "https://refraction.network/",
                "internal": false,
                "reflection": false,
                "title": "Refraction Networking",
                "clicks": 0
            },
            {
                "url": "https://censorbib.nymity.ch/#McPherson2016a",
                "internal": false,
                "reflection": false,
                "title": "The Internet censorship bibliography",
                "clicks": 0
            },
            {
                "url": "https://www.cs.bu.edu/fac/crovella/paper-archive/imc04-geolocation-full.pdf",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://www.bamsoftware.com/papers/fronting/",
                "internal": false,
                "reflection": false,
                "title": "Blocking-resistant communication through domain fronting",
                "clicks": 0
            },
            {
                "url": "https://en.wikipedia.org/wiki/Anycast",
                "internal": false,
                "reflection": false,
                "title": "Anycast - Wikipedia",
                "clicks": 0
            },
            {
                "url": "https://censorbib.nymity.ch/#Holowczak2015a",
                "internal": false,
                "reflection": false,
                "title": "The Internet censorship bibliography",
                "clicks": 0
            }
        ],
        "read": true,
        "user_title": "dnstt developer",
        "title_is_group": false,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 26,
        "hidden": false,
        "trust_level": 3,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/paper-summary-too-close-for-comfort-morasses-of-anti-censorship-in-the-era-of-cdns-pets-2021/1410/1",
        "can_translate": false
    }
]