[
    {
        "id": 1806,
        "name": "",
        "username": "tango",
        "avatar_template": "/letter_avatar_proxy/v4/letter/t/e36b37/{size}.png",
        "created_at": "2020-08-24T17:14:01.763Z",
        "cooked": "<p>Triplet Censors: Demystifying Great Firewall’s DNS Censorship Behavior<br>\nAnonymous, Arian Akhavan Niaki, Nguyen Phong Hoang, Phillipa Gill, Amir Houmansadr<br>\n<a href=\"https://censorbib.nymity.ch/#Anonymous2020a\" class=\"onebox\" target=\"_blank\" rel=\"nofollow noopener\">https://censorbib.nymity.ch/#Anonymous2020a</a><br>\n<a href=\"https://www.usenix.org/conference/foci20/presentation/anonymous\" rel=\"nofollow noopener\">https://www.usenix.org/conference/foci20/presentation/anonymous</a> (video and slides)<br>\n<a href=\"https://gfw.report/publications/foci20_dns/en/\" rel=\"nofollow noopener\">https://gfw.report/publications/foci20_dns/en/</a> (code and data)</p>\n<p>The paper is a study of DNS injection by the GFW. While there have been many similar studies, this one goes further in its methodology, finds interesting new behavior, and explains phenomena that past work could not. The most striking observations are that different groups of domains are poisoned by different subsets of the poison IP address pool; and that there are (at least) three different DNS injectors, each with its own network fingerprint, responding to distinct but overlapping subsets of domains.</p>\n<p>The primary experiment is nine months of querying a million domains every two hours. The queries are sent from outside China to a controlled VPS inside China, taking advantage of the bidirectionality of DNS injection. The overall trend is for more domains to be blocked over time, increasing from 24000 in September 2019 to 24600 in May 2020. Examining the hour-by-hour changes reveals certain implementation details, for example an evident pattern change from <code>*youtube.com</code> to the more specific <code>*.youtube.com</code> resulted in the sudden unblocking of about 50 domains. Before 2019-11-23, DNS injections drew from a pool of 1510 phony IP addresses; but on that date, the size of the pool suddenly shrank to 216. Curiously, the selection of a phony IP address is not uniform for every injection; each domain draws from only a subset of the total pool. Domains may be organized into groups, according to which subset of phony IP addresses they use. Group 4, for example, consists of 33 Google-related domains, each of which is poisoned by a subset of only four IP addresses. The IP addresses making up the total pool are not random—most of them belong to US-based organizations like Facebook, Dropbox, and Twitter, though most do not point to a live host.</p>\n<p>There is more than one DNS injector. The authors provide robust network fingerprints for three, using features such as the flags in the IP and DNS headers, and trends in the IP ID and IP TTL fields. The injectors handle different (but overlapping) subsets of domains and draw from different (but overlapping) IP address pools, corresponding to the domain groups mentioned earlier. Injector 1 handles the fewest domains, but the most popular. Injector 3’s domains are a subset of Injector 2’s. Injector 1 uses incrementing TTLs and Injector 2’s TTLs are random, but Injector 3 does something weird: it reflects the TTL of the query in the response, meaning that the original TTL must be at least <em>twice</em> the distance to the injector for the injected response to make it back to the sender. Taking this quirk of TTL into account, all three injectors lie at the same hop distance away from the probe host, and timing measurements are consistent with all three being co-located.</p>\n<p>The authors then do a separate, one-time, multi-path experiment, querying a single blocked domain name against a random IP address in virtually every network prefix announced in China, 36146 addresses and 417 ASes in total. 92% of prefixes are affected by at least one injector, and 62% are affected by all three. 4% are affected by yet a fourth injector, whose fingerprint does not match that of the other three.</p>\n<p>Thanks to the authors for reviewing a draft of this summary.</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2020-08-24T17:14:01.763Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 17,
        "reads": 5,
        "readers_count": 4,
        "score": 86.0,
        "yours": false,
        "topic_id": 653,
        "topic_slug": "paper-summary-triplet-censors-demystifying-great-firewalls-dns-censorship-behavior-foci-2020",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://censorbib.nymity.ch/#Anonymous2020a",
                "internal": false,
                "reflection": false,
                "title": "The Internet censorship bibliography",
                "clicks": 1
            },
            {
                "url": "https://gfw.report/publications/foci20_dns/en/",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://www.usenix.org/conference/foci20/presentation/anonymous",
                "internal": false,
                "reflection": false,
                "title": "Triplet Censors: Demystifying Great Firewall’s DNS Censorship Behavior | USENIX",
                "clicks": 0
            },
            {
                "url": "https://ntc.party/t/bleeding-wall-a-hematologic-examination-on-the-great-firewall-foci-2024/7896",
                "internal": true,
                "reflection": true,
                "title": "Bleeding Wall: A Hematologic Examination on the Great Firewall (FOCI 2024)",
                "clicks": 1
            }
        ],
        "read": true,
        "user_title": "dnstt developer",
        "title_is_group": false,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 26,
        "hidden": false,
        "trust_level": 3,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/paper-summary-triplet-censors-demystifying-great-firewalls-dns-censorship-behavior-foci-2020/653/1",
        "can_translate": false
    }
]