[
    {
        "id": 683,
        "name": "",
        "username": "tango",
        "avatar_template": "/letter_avatar_proxy/v4/letter/t/e36b37/{size}.png",
        "created_at": "2019-12-01T18:38:17.499Z",
        "cooked": "<p>Conjure: Summoning Proxies from Unused Address Space<br>\nSergey Frolov, Jack Wampler, Sze Chuen Tan, J. Alex Halderman, Nikita Borisov, Eric Wustrow<br>\n<a href=\"https://censorbib.nymity.ch/#Frolov2019b\" class=\"onebox\" target=\"_blank\" rel=\"nofollow noopener\">https://censorbib.nymity.ch/#Frolov2019b</a></p>\n<p>Conjure is a refraction networking design, distinguished from others in that the covert traffic is directed towards an unused address (“phantom host”) rather than a live decoy server. The design eliminates a lot of technical complexity and allows for better performance and vastly more freedom in choosing an obfuscated proxy protocol.</p>\n<p>Using the system requires two steps. First, the client sends a covert registration signal to a Conjure station at a cooperating ISP that indicates the client’s desire to start a refraction networking session. There are many imaginable ways to send a registration signal; the authors have found it convenient to reuse the chosen-ciphertext steganography technique from <a href=\"https://censorbib.nymity.ch/#Wustrow2014a\" rel=\"nofollow noopener\">TapDance (§3.1)</a>, which involves sending an HTTPS request through the Conjure station to a real web server (this is not the part that uses unused addresses). Besides signaling the start of a Conjure session, the registration message contains a seed that allows the client and the Conjure station to agree on the address of a phantom host. In the second step, the client sends packets that are directed to the phantom address, and the Conjure station intercepts them and redirects them to an application proxy service. The client and Conjure station do not need to maintain a synchronized view of what addresses are unused behind the Conjure station: in the event that registration results in a “phantom” that is actually live, the client just tries again with a different seed.</p>\n<p>Past refraction networking systems, in order to maintain the illusion of continuing conversation with a live decoy host, have had to play tricks with details of TLS and HTTP that put constraints on the data-transfer protocol. Conjure, because it doesn’t need to maintain that illusion, can choose any covert proxy protocol—basically, anything that on its own won’t get blocked by a censor, like obfs4, WebRTC, obfuscated SSH, or TLS with some form of SNI protection. The authors tested an implementation by deployment at a mid-sized ISP in the manner of <a href=\"https://censorbib.nymity.ch/#Frolov2017a\" rel=\"nofollow noopener\">Frolov et al. 2017</a>. Conjure has 1000× better upload bandwidth, more consistent download bandwidth, and lower latency than TapDance.</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2019-12-01T18:38:17.499Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 31,
        "reads": 6,
        "readers_count": 5,
        "score": 156.2,
        "yours": false,
        "topic_id": 248,
        "topic_slug": "paper-summary-conjure-summoning-proxies-from-unused-address-space-ccs-19",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://censorbib.nymity.ch/#Frolov2019b",
                "internal": false,
                "reflection": false,
                "title": "CensorBib",
                "clicks": 1
            },
            {
                "url": "https://censorbib.nymity.ch/#Frolov2017a",
                "internal": false,
                "reflection": false,
                "title": "CensorBib",
                "clicks": 0
            },
            {
                "url": "https://censorbib.nymity.ch/#Wustrow2014a",
                "internal": false,
                "reflection": false,
                "title": "CensorBib",
                "clicks": 0
            }
        ],
        "read": true,
        "user_title": "dnstt developer",
        "title_is_group": false,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 26,
        "hidden": false,
        "trust_level": 3,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/paper-summary-conjure-summoning-proxies-from-unused-address-space-ccs-19/248/1",
        "can_translate": false
    }
]