[
    {
        "id": 86,
        "name": null,
        "username": "ValdikSS",
        "avatar_template": "/user_avatar/ntc.party/valdikss/{size}/2_2.png",
        "created_at": "2019-09-11T11:51:51.670Z",
        "cooked": "<p>Мои идеи:</p>\n<p><strong>Первая</strong> — доработка GoodbyeDPI, реализация новых способов обхода DPI, таких как TCB creation, TCB teardown, data reassembly, tcp state desync, да и просто изменение флагов в TCP SYN так, чтобы можно было менять размер SYN’а. Если интересуют подробности методов, я напишу детально.<br>\nЧтобы сделать поддержку новых методов обхода, сначала нужно реализовать отслеживание состояния соединений (tcp conntrack), как минимум.<br>\nСейчас в GoodbyeDPI реализована только по-пакетная обработка, а часто в одном пакете недостаточно данных для корректного определения протокола, либо данных слишком много, чтобы они вместились в один пакет, из-за чего с ними неудобно работать в пакетном режиме. Было бы гораздо удобней писать новые методы обхода в псевдо-потоковом режиме, что-то вроде простого tcp reassembly, чтобы можно было получить данные нескольких предыдущих пакетов, или объединять их в один большой.<br>\nТакже нужна помощь в добавлении поддержки Linux и macOS, для этого сначала нужно вынести весь платформозависимый код в отдельный модуль, абстрагироваться от WinDivert API для обработки пакетов. Код для этого можно позаимствовать из проекта reqrypt.</p>\n<p><strong>Вторая идея</strong> — сделать патчи для библиотек шифрования NSS (используется браузерами Firefox и Chrome, и основанными на них) и OpenSSL (широко используется другими программами), в части работы с сетью.<br>\nМногие DPI можно обойти, добавив точку в конец домена, или изменив регистр каких-либо букв в имени домена, в TLS-хендшейке (расширение TLS Server Name Indication). Я сделал патчи для NSS, которые добавляют точку и меняют регистр, но не все TLS-стеки такое поддерживают (по стандарту, точки не должно быть). Нужно доделать патчи, сделать так, чтобы, в случае неудачи, происходило автоматическое переподключение и попытка установить соединение как обычно, без патчей, так, чтобы это было прозрачно для программ, использующих библиотеки (чтобы оригинальную библиотеку можно было заменить патченной, без необходимости правки кода самих программ). После чего можно будет выпустить портативные версии программ с патченной библиотекой, например, Firefox (для всех платформ, в т.ч. Android).</p>\n<p>Кроме модификации настоящего домена в TLS SNI, можно также передавать случайные популярные домены в SNI, например, <a href=\"http://google.com\" rel=\"nofollow noopener\">google.com</a>, и, если удаленный сервер в ответ на это отдаст какой-то нормальный сертификат на какой-либо домен, валидировать его и разрешать соединение. Это достаточно опасная и спорная функциональность, но в качестве дополнительной возможности — сойдет.</p>\n<p><strong>Третья идея</strong> — сделать библиотеку “libgoodbyedpi”, в которую можно передавать данные пакетов, а она бы возвращала измененный пакет, чтобы он обходил DPI, либо сама отправляла его в измененном виде в сеть.<br>\nЯ вижу два подхода к реализации: либо в виде библиотеки и патчей для популярных сетевых библиотек (libcurl, например, который бы с патчами линковался с libgoodbyedpi), либо в виде библиотеки, хукающей сетевые функции, и самостоятельно прозрачно изменяющей пакеты (чтобы можно было загрузить через LD_PRELOAD или аналогичный способ для других ОС).<br>\nЧто-то вроде GoodbyeDPI, только для конкретных программ, а не на всю систему целиком. Преимущество в том, что можно будет без особых проблем сделать библиотеку кросс-платформенной, и делать байндинги для разных сетевых библиотек разных операционных систем.</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2019-09-11T11:51:56.150Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 65,
        "reads": 60,
        "readers_count": 59,
        "score": 336.8,
        "yours": false,
        "topic_id": 51,
        "topic_slug": "%D0%B8%D0%B4%D0%B5%D0%B8-%D0%B8-%D0%B4%D0%B0%D0%BB%D1%8C%D0%BD%D0%B5%D0%B9%D1%88%D0%B8%D0%B5-%D0%BF%D0%BB%D0%B0%D0%BD%D1%8B",
        "display_username": null,
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "http://google.com",
                "internal": false,
                "reflection": false,
                "clicks": 0
            }
        ],
        "read": true,
        "user_title": "AntiZapret staff",
        "title_is_group": false,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": true,
        "admin": true,
        "staff": true,
        "user_id": 1,
        "hidden": false,
        "trust_level": 2,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/%D0%B8%D0%B4%D0%B5%D0%B8-%D0%B8-%D0%B4%D0%B0%D0%BB%D1%8C%D0%BD%D0%B5%D0%B9%D1%88%D0%B8%D0%B5-%D0%BF%D0%BB%D0%B0%D0%BD%D1%8B/51/1",
        "can_translate": false
    }
]