[
    {
        "id": 26253,
        "name": null,
        "username": "serj888",
        "avatar_template": "/letter_avatar_proxy/v4/letter/s/f475e1/{size}.png",
        "created_at": "2024-06-05T14:17:43.707Z",
        "cooked": "<p>На openwrt места очень мало осталось и хоть что не будь для лучшей работы хотелось сделать.  Например откидывание rst можно сказать что почти не помогает.<br>\nМожно ли что нить подобное ещё добавить по типу rst и какой пакет нужно установить дополнительно, для роутеров с ограниченной памятью, место осталось 400 кб.<br>\nСам болван даже нет возможности протестировать и понятно что надо покупать роутер с большим объёмом памяти, но у меня он не один, их много и это накладно менять все и хороший нужный тяжело найти в продаже. На гитхабе болван очень много инфы, но ни одной инструкции, так написано в общих чертах и хоть что то найти для себя полезное, так и не нашел. Там всё написано для программистов которые шарят в линуксе, а таких можно по пальцам пересчитать, их очень мало и ни один из них не перевёл это всё на нормальный язык, так чтоб было понятно всем. К примеру хочешь сделать это, надо поставить такой пакет, а весит он столько, это в самом начале должно быть, чтоб понимать, читать дальше или нет, хочешь попроще, вот вариант другой, пусть не эффективный, но тоже лучше чем ничего. А вообще было бы классно еслиб сделали меню болвана в luci, подтянулись бы сразу тысячи пользователей, а то и больше и сделать 2 варианта, один для минимальной памяти, а второй full пакет, для роутеров с большим объёмом памяти.<br>\nГудбай стал известен благодаря лаунчеру, который запускаешь и ставишь галки и я находил советы и рекомендации в разных точках планеты, где ссылаются на гудбай, он стал реально известный на всю планету.<br>\nЗа болван инфы практически нет нигде, это сложно и не понятно, поэтому он и не стал популярным и если для винды объём памяти значения не имеет, то для роутера это значение огромное и если бы было меню в люси, то тогда пользователи даже задумались о покупке другого роутера, в любом случаи пользователи знали, что можно просто поставить пакет и юзать через меню и всем миром довели бы прогу до идеала, так как советы и просьбы посыпались бы со всех точек планеты. Но хотя бы просто минималки, без болвана, раз не хватает места, такой то пакет и такая комбинация только через nftables, так как iptables уже можно сказать ушел в прошлое, а устанавливать пакеты для iptables, это может привести к сбою самого роутера, та и места нет их устанавливать. Все новые прошивки работают через nftables и возможно места много и не нужно если использовать только его</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2024-06-05T14:17:43.707Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 14,
        "reads": 72,
        "readers_count": 71,
        "score": 84.4,
        "yours": false,
        "topic_id": 7940,
        "topic_slug": "%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE-%D0%BA%D0%B0%D0%BA-%D1%82%D0%BE-%D1%80%D0%B5%D0%B0%D0%BB%D0%B8%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D1%8C-%D0%BC%D0%B8%D0%BD%D0%B8%D0%BC%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B5-%D0%B4%D0%B5%D0%B9%D1%81%D1%82%D0%B2%D0%B8%D1%8F-%D0%B1%D0%BE%D0%BB%D0%B2%D0%B0%D0%BD",
        "display_username": null,
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "read": true,
        "user_title": null,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 3388,
        "hidden": false,
        "trust_level": 2,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE-%D0%BA%D0%B0%D0%BA-%D1%82%D0%BE-%D1%80%D0%B5%D0%B0%D0%BB%D0%B8%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D1%8C-%D0%BC%D0%B8%D0%BD%D0%B8%D0%BC%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B5-%D0%B4%D0%B5%D0%B9%D1%81%D1%82%D0%B2%D0%B8%D1%8F-%D0%B1%D0%BE%D0%BB%D0%B2%D0%B0%D0%BD/7940/1",
        "can_translate": false
    }
]