[
    {
        "id": 1117,
        "name": "cypherpunks:writecodes",
        "username": "cypherpunks",
        "avatar_template": "/letter_avatar_proxy/v4/letter/c/e19adc/{size}.png",
        "created_at": "2020-04-04T14:14:32.477Z",
        "cooked": "<blockquote>\n<p><a href=\"https://nitter.net/ValdikSS/status/1246201000261804032#m\" rel=\"noopener nofollow ugc\">Если скажу, что в ZeroNet есть email, блоги с комментариями, форумы, видеохостинги, wiki-сайты, чаты, аналог github, локальный поиск текста по всем когда-либо открытым сайтам, автоматический real-time аналог RSS для всех сайтов разом, свой OAuth, поддержка NAT/Tor, заинтересует?</a> <a class=\"mention\" href=\"/u/valdikss\">@ValdikSS</a></p>\n</blockquote>\n<p>Настораживают гордые заявления разработчиков, что сеть основана на «биткоин-криптографии». Программисты IPFS хотя бы постеснялись о подобном заявлять на главной странице сайта, и впоследствии отчасти дистанцировались от FileCoin.</p>\n<p>Бессерверные приложения незаменимы для обмена информацией, запрещённой к распространению, но в остальном проигрывают по производительности и времени автономной работы, не говоря о том, что более требовательны к технической подготовке рядового пользователя. В популярном сознании они начинают ассоциироваться с киберпреступностью, а ограниченное число поклонников сети не в состоянии отстоять своё доброе имя.</p>\n<p>Бессерверные веб-сайты целиком полагаются на JavaScript, что особенно негативно отражается на жизни сотового вдали от розетки. Традиционные поисковые роботы не действуют.</p>\n<p>Скорость развития и продвижения что IPFS, что ZeroNet, мягко говоря, оставляет желать лучшего. Даже оригинальный BitTorrent обгонял их на самом начальном этапе, подавая надежду, в то время как ZN и IPFS скорее вызывают депрессию.</p>\n<p>В целом, плачевное положение с хранением и организацией информации офлайн и в пределах домашней сети сейчас представляется более серьёзной проблемой. Вместо фундаментальных улучшений на уровне операционных систем и коренных протоколов (сотовые фактически превратились в тонкий клиент для онлайн-ресурсов, ситуация на компьютерах становится хуже из года в год, по мере того, как объёмы информации растут, а единой схемы для её организации, с которой согласны все, нет до сих пор). Сотни приложений конкурируют за ресурсы системы и внимание пользователя, и ZeroNet—это очередное такое приложение.</p>\n<p>HTML давно уже не притворяется языком семантической разметки. Часть Всемирной Паутины, отвечающая за документы онлайн, не получает должного внимания с середины 1990-х. Google, например, не поддерживает такие странные, но перспективные и когда-то продвигаемые с завидной страстью вещи, как RDF. В таких условиях, неудивительно, что авторы навёрстывают недостающие возможности благодаря крупным соцсетям и оставляют личные веб-сайты.</p>\n<p>Порой мне кажется, что устаревший компьютер в вузовской библиотеке, исполняющий давно вышедшую из поддержки программу каталога, знает конкретнее, разбирается быстрее и выдаёт больше сигнала, чем шума, чем самый современный ноутбук с голосовым ассистентом. Если такова ситуация без децентрализованных альтернатив, что будет, когда ко всему этому добавится ZeroNet?</p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2020-04-09T07:19:03.996Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 14,
        "reads": 37,
        "readers_count": 36,
        "score": 77.4,
        "yours": false,
        "topic_id": 424,
        "topic_slug": "zeronet",
        "display_username": "cypherpunks:writecodes",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 2,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://nitter.net/ValdikSS/status/1246201000261804032#m",
                "internal": false,
                "reflection": false,
                "title": "ValdikSS (@ValdikSS): \"Если скажу, что в ZeroNet есть email, блоги с комментариями, форумы, видеохостинги, wiki-сайты, чаты, аналог github, локальный поиск текста по всем когда-либо открытым сайтам, автоматический real-time аналог RSS для всех сайтов разо",
                "clicks": 19
            }
        ],
        "read": true,
        "user_title": "",
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 105,
        "hidden": false,
        "trust_level": 2,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "user_suspended": true,
        "post_url": "/t/zeronet/424/1",
        "can_translate": false
    }
]