[
    {
        "id": 27731,
        "name": "",
        "username": "runetchecker",
        "avatar_template": "/letter_avatar_proxy/v4/letter/r/b3f665/{size}.png",
        "created_at": "2024-07-25T13:30:13.152Z",
        "cooked": "<p>Таким образом планируется лишить дохода лиц, осуществляющих «провокационную деятельность и недоброжелательные действия в отношении интересов Российской Федерации», а также помешать заработку самих платформ, уже запрещённых в РФ.</p>\n<p>Депутаты Госдумы приняли в первом чтении законопроект <a href=\"https://sozd.duma.gov.ru/bill/652920-8\" rel=\"noopener nofollow ugc\">№652920-8</a> «О внесении изменений в статью 12 Федерального закона „О противодействии экстремистской деятельности“ и статьи 5 и 38 Федерального закона „О рекламе“ (о запрете распространения рекламы на информационных ресурсах иностранных или международных организаций, деятельность которых признана нежелательной или запрещена, а также иных информационных ресурсах, доступ к которым ограничен в соответствии с законодательством Российской Федерации)».</p>\n<p>Запрет этот распространяется в том числе на ресурсы компании Meta (признана «экстремистской организацией» и запрещена в РФ) — Facebook и Instagram.</p>\n<p>Авторы документа <a href=\"https://roskomsvoboda.org/post/zapret-reklamy-na-nezhelashkah/\" rel=\"noopener nofollow ugc\">уверяют</a>, что «противоправные информационные ресурсы» продолжают зарабатывать деньги от рекламы. Доходы, считают авторы инициативы, в том числе получают «иные заинтересованные лица», которые «не являются резидентами Российской Федерации и осуществляют провокационную деятельность и недоброжелательные действия» в отношении интересов России. В пояснительной записке указано, что:</p>\n<blockquote>\n<p>«Получение дохода от рекламы владельцами противоправных информационных ресурсов позволяет им создавать новый контент, включая запрещенную информацию, и поддерживать интерес пользователей к своим ресурсам».</p>\n</blockquote>\n<p>Перед голосованием с докладом выступил один из авторов законопроекта, глава IT-комитета Госдумы Александр Хинштейн.</p>\n<p>В разработке документа, сказал он, приняли участие представители всех думских фракций, а также несколько сенаторов. По словам Хинштейна:</p>\n<blockquote>\n<p>«Законопроект продолжает начатую линию наведения порядка на информационном фронте».</p>\n</blockquote>\n<p>Теперь пришла очередь для запрета рекламы на заблокированных ресурсах и на тех, чья деятельность признана нежелательной.</p>\n<p>«Россия вынуждена защищать свой цифровой суверенитет, вести информационную войну — точнее, отвечать на нападения в информационном пространствуе, — заявил депутат. — Государство вынуждено реагировать на те ресурсы, которые ведут антироссийскую деятельность, где идёт пропаганда нетрадиционных сексуальных отношений, педофилии и наркомании».</p>\n<p>Ссылаясь на реестр учёта рекламы, который существует уже два года, Хинштейн заявил, что российские рекламодатели вкладывают миллиарды рублей на рекламу на запрещённых ресурсах, — уже только в текущем году на это ушло 2,5 млрд рублей:</p>\n<blockquote>\n<p>«Получается, наш рекламодатель, не напрямую, «в одно касание» оплачивает войну, ведущуюся против России».</p>\n</blockquote>\n<p>Ресурсам о нетрадиционной ориентации он посвятил большую часть своего выступления, сказав, что даже на заблокированном в 2017 году гей-сайте до сих пор размещается реклама, в том числе одного из крупных российских банков. По словам депутата, закон не нанесёт большого ущерба Рунету, поскольку ещё до блокировки иностранных соцсетей существовала российская альтернатива, причём посещаемость их на тот момент была выше, уверен он.</p>\n<p>От ЛДПР прозвучал вопрос о том, будет ли разблокирован Instagram, да и не только он, потому что с помощью иностранных площадок необходимо «доносить миру правду о России», поэтому здесь как нельзя кстати пришлась бы и эта соцсеть, и Facebook. Тем более, что российские депутаты, да и остальные граждане всё равно туда заходят, используя VPN.</p>\n<p>Хинштейн по сути повторил свой недавний пост в Telegram, где <a href=\"https://t.me/Hinshtein/7271\" rel=\"noopener nofollow ugc\">говорилось</a> следующее:</p>\n<blockquote>\n<p>«Для снятия блокировки с Instagram, платформе нужно выполнить лишь одно условие — исполнять российское законодательство. Пока никаких шагов к этому со стороны площадки предпринято, к сожалению, не было».</p>\n</blockquote>\n<p>Отвечая на вопрос «либерал-демократов», Хинштейн подчеркнул, что блокировка иностранных соцсетей не носит политического характера, приведя в пример Twitter (X), который был заблокирован в связи с якобы неудалением контента, связанного с педофилией и другой вредной информацией. Но в данном случае депутат обобщает и манипулирует, поскольку даже формально Twitter был по озвученным им обвинениям не заблокирован, а <a href=\"https://roskomsvoboda.org/cards/card/twitter-vs-rkn/\" rel=\"noopener nofollow ugc\">замедлен</a>. Блокировка же как раз <a href=\"https://reestr.rublacklist.net/ru/?q=twitter.com\" rel=\"noopener nofollow ugc\">произошла</a> из соображений военной цензуры, как и в случае с <a href=\"https://reestr.rublacklist.net/ru/?q=instagram.com\" rel=\"noopener nofollow ugc\">Instagram</a> и <a href=\"https://reestr.rublacklist.net/ru/?q=facebook.com\" rel=\"noopener nofollow ugc\">Facebook</a>.</p>\n<p>Алексей Куринный (КПРФ) поинтересовался — откуда взяты цифры по рекламе, если вышеперечисленные сайты заблокированы и учёт рекламы из России на них затруднительно определить, поскольку заходить приходится через VPN. Также он уточнил, как будет наказан тот, кто после принятия закона рекламу разместить, будет ли отдельный состав для этого.</p>\n<p>Хинштейн ответил, что цифры официальные, а ответственность «будем обсуждать», но по его мнению, уже существующая норма КоАП (какая, депутат не назвал) уже на этот вопрос отвечает.</p>\n<p>Законопроект в итоге был принят большинством голосов, причём 11 депутатов проголосовали против</p>\n<p>Источник: <a href=\"https://roskomsvoboda.org/ru/post/reklama-nezhelat-sayty-per-chten/\" rel=\"noopener nofollow ugc\">Роскомсвобода</a></p>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 1,
        "updated_at": "2024-07-25T13:30:13.152Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 5,
        "reads": 82,
        "readers_count": 81,
        "score": 41.4,
        "yours": false,
        "topic_id": 8202,
        "topic_slug": "%D0%B7%D0%B0%D0%BF%D1%80%D0%B5%D1%82-%D1%80%D0%B5%D0%BA%D0%BB%D0%B0%D0%BC%D1%8B-%D0%BD%D0%B0-%C2%AB%D0%BD%D0%B5%D0%B6%D0%B5%D0%BB%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D1%85%C2%BB-%D1%80%D0%B5%D1%81%D1%83%D1%80%D1%81%D0%B0%D1%85-%D0%BF%D1%80%D0%BE%D1%88%D1%91%D0%BB-i-%D1%87%D1%82%D0%B5%D0%BD%D0%B8%D0%B5",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
            {
                "url": "https://roskomsvoboda.org/ru/post/reklama-nezhelat-sayty-per-chten/",
                "internal": false,
                "reflection": false,
                "title": "Запрет рекламы на «нежелательных» ресурсах прошёл I чтение",
                "clicks": 8
            },
            {
                "url": "https://roskomsvoboda.org/cards/card/twitter-vs-rkn/",
                "internal": false,
                "reflection": false,
                "title": "Замедление Twitter. Что случилось, чем это может закончиться и какие антицензурные инструменты мне использовать?",
                "clicks": 1
            },
            {
                "url": "https://sozd.duma.gov.ru/bill/652920-8",
                "internal": false,
                "reflection": false,
                "clicks": 1
            },
            {
                "url": "https://reestr.rublacklist.net/ru/?q=twitter.com",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://reestr.rublacklist.net/ru/?q=instagram.com",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://reestr.rublacklist.net/ru/?q=facebook.com",
                "internal": false,
                "reflection": false,
                "clicks": 0
            },
            {
                "url": "https://t.me/Hinshtein/7271",
                "internal": false,
                "reflection": false,
                "title": "Telegram: Contact @Hinshtein",
                "clicks": 0
            },
            {
                "url": "https://roskomsvoboda.org/post/zapret-reklamy-na-nezhelashkah/",
                "internal": false,
                "reflection": false,
                "title": "В Госдуму внесён законопроект о запрете рекламы на «нежелательных» ресурсах",
                "clicks": 0
            }
        ],
        "read": true,
        "user_title": null,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 1008,
        "hidden": false,
        "trust_level": 2,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": false,
        "wiki": false,
        "post_url": "/t/%D0%B7%D0%B0%D0%BF%D1%80%D0%B5%D1%82-%D1%80%D0%B5%D0%BA%D0%BB%D0%B0%D0%BC%D1%8B-%D0%BD%D0%B0-%C2%AB%D0%BD%D0%B5%D0%B6%D0%B5%D0%BB%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D1%85%C2%BB-%D1%80%D0%B5%D1%81%D1%83%D1%80%D1%81%D0%B0%D1%85-%D0%BF%D1%80%D0%BE%D1%88%D1%91%D0%BB-i-%D1%87%D1%82%D0%B5%D0%BD%D0%B8%D0%B5/8202/1",
        "can_translate": false
    }
]